//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Погрешно корисничко име или лозинка";
"_cancelled_by_user"                    = "Трансфер поништен";
"_error_folder_destiny_is_the_same_"    = "Није могуће да померите фасциклу у саму себе";
"_error_not_permission_"                = "Немате дозвола да завршите ову операцију";
"_error_path_"                          = "Не могу да отворим овај фајл или фасциклу. Проверите да ли постоји";
"_file_upload_not_exitst_"              = "Фајл који желите да отпремите не постоји";
"_forbidden_characters_from_server_"    = "Има садржи бар један недозвољени карактер";
"_not_connected_internet_"              = "Грешка у конекцији са сервером";
"_not_possible_connect_to_server_"      = "Тренутно није могуће повезати се са сервером";
"_not_possible_create_folder_"          = "Није могуће направити фасциклу";
"_server_down_"                         = "Не могу да успоставим везу са сервером";
"_time_out_"                            = "Истекло време, покушајте поново";
"_unknow_response_server_"              = "Неочекивани одговор са сервера";
"_user_autentication_required_"         = "Потребно пријављивање корисника";
"_file_directory_locked_"               = "Фајл или фасцикла закључани";
"_ssl_certificate_untrusted_"           = "Сертификат овог сервера је неисправан";
"_internal_server_"                     = "Интерна грешка на серверу";
"_file_already_exists_"                 = "Операција не може да се изведе, већ постоји фајл са истим именом";
"_file_folder_not_exists_"              = "Изворни фајл није нађен на задатој путањи";
"_folder_contents_nochanged_"           = "Садржај фасцикле се није изменио";
"_images_invalid_converted_"            = "Слика није исправна и од ње не може да се направи умањена сличица";
"_method_not_expected_"                 = "Неочекивани захтевани метод";
"_reauthenticate_user_"                 = "Приступ истекао, поново се пријавите";
"_server_error_retry_"                  = "Сервер је привремено недоступан";
"_too_many_files_"                      = "Превише фајлова би било укључено у ову операцију";
"_too_many_request_"                    = "Слање превише захтева може узроковати да достигнете лимите";
"_user_over_quota_"                     = "Достигнута квота складишта";
"_ssl_connection_error_"                = "Грешка у SSL конекцији, покушајте поново";
"_bad_request_"                         = "Лош захтев";
"_webdav_locked_"                       = "WebDAV закључан: Ресурс коме се приступа је закључан";
"_error_user_not_available_"            = "Корисник није више доступан";
"_server_response_error_"               = "Грешка у садржају у одговору са сервера";


